** Unidata Technology with Python (in construction for 2015)

- *What*: A series of IPython Notebooks on exploring Unidata technology with Python for the 2014 Unidata Training Workshop.
- *When*: <2014-10-21 Tue>--<2014-10-22 Wed>
- *Where*: [[http://www.unidata.ucar.edu/about/#visit][UCAR Foothills Lab 4, Room 1201]]

**** Quick Start

For these IPython Notebooks we will be using a Python environment with the
following libraries installed:

- [[http://www.numpy.org/][numpy]]
- [[https://code.google.com/p/netcdf4-python/][netcdf4-python]]
- [[http://matplotlib.org/][matplotlib]]
- [[http://scitools.org.uk/cartopy/][cartopy]]
- [[https://pypi.python.org/pypi/OWSLib/][OWSLib]]
- [[https://github.com/Unidata/pyudl][pyudl]]

The easiest way to install these libraries is with [[http://conda.pydata.org/][conda]]. First install the [[http://conda.pydata.org/][conda
package manager]]. Then,

#+BEGIN_SRC shell
conda config --add channels https://conda.binstar.org/scitools

conda config --add channels https://conda.binstar.org/Unidata

conda create -n workshop python=3 numpy matplotlib cartopy ipython-notebook netcdf4 owslib metpy siphon networkx

source activate workshop

git clone https://github.com/Unidata/unidata-python-workshop.git

cd unidata-python-workshop

ipython notebook
#+END_SRC

**** Workshop Schedule for <2015-07-20 Mon>

|----+-------------------------------------------------+-------------------+-----------+--------+----------|
|    | Section                                         | IPyNB or Markdown | Presenter | Length |     Time |
|----+-------------------------------------------------+-------------------+-----------+--------+----------|
|  1 | Continental breakfast                           |                   |           |   0:30 | 08:30:00 |
|  2 | [[http://figshare.com/s/613753ea58ae11e4a40206ec4b8d1f61][Introductions and overview]]                      |                   | Ethan     |   0:20 | 09:00:00 |
|  3 | Software carpentry for science w/ git/github    |                   | All       |   1:45 | 09:20:00 |
|  4 | Break                                           |                   |           |   0:20 | 11:05:00 |
|  5 | Software carpentry for science w/ conda/binstar |                   | All       |   1:00 | 11:25:00 |
|  6 | Lunch on your own                               |                   |           |   1:15 | 12:25:00 |
|  7 | [[http://nbviewer.ipython.org/urls/raw.github.com/Unidata/unidata-python-workshop/master/ipython-notebook-examples][IPython notebook introduction]] (including 2.0)   | ipython-notebook  | Ward      |   1:00 | 13:40:00 |
|  8 | [[http://nbviewer.ipython.org/github/Unidata/unidata-python-workshop/blob/master/numpy.ipynb][Numpy with intro to matplotlib Part 1]]           | numpy             | Ryan      |   1:00 | 14:40:00 |
|  9 | Break                                           |                   |           |   0:20 | 15:40:00 |
| 10 | [[http://nbviewer.ipython.org/github/Unidata/unidata-python-workshop/blob/master/numpy.ipynb][Numpy with intro to matplotlib]] Part 2           | numpy             | Ryan      |   1:00 | 16:00:00 |
| 11 | End of day 1                                    |                   |           |        | 17:00:00 |
|----+-------------------------------------------------+-------------------+-----------+--------+----------|
#+TBLFM: @3$6..@-1$6=@-1$5+@-1$6;T::$1=@#-1

**** Workshop Schedule for <2015-07-21 Tue>

|----+-----------------------------------------------+-------------------+-----------+--------+----------|
|    | Section                                       | IPyNB or Markdown | Presenter | Length |     Time |
|----+-----------------------------------------------+-------------------+-----------+--------+----------|
|  1 | Continental breakfast                         |                   |           |   0:30 | 08:30:00 |
|  2 | [[http://figshare.com/s/c187717c58ad11e48fe806ec4b8d1f61][Introduction to netCDF]]                        | intro_netCDF      | Russ      |   1:00 | 09:00:00 |
|  3 | Break                                         |                   |           |   0:10 | 10:00:00 |
|  4 | [[http://nbviewer.ipython.org/urls/raw.github.com/Unidata/unidata-python-workshop/master/reading_netCDF.ipynb][Reading netCDF]]                                | reading_netCDF    | Jeff W.   |   1:00 | 10:10:00 |
|  5 | [[http://nbviewer.ipython.org/urls/raw.github.com/Unidata/unidata-python-workshop/master/writing_netCDF.ipynb][Writing netCDF]]                                | writing_netCDF    | Jeff W.   |   1:00 | 11:10:00 |
|  6 | Lunch on your own                             |                   |           |   1:00 | 12:10:00 |
|  7 | [[http://nbviewer.ipython.org/urls/raw.github.com/Unidata/unidata-python-workshop/master/matplotlib.ipynb][Geoscience vis w/ matplotlib/cartopy]]          | matplotlib        | Ryan      |   1:30 | 13:10:00 |
|  8 | Break                                         |                   |           |   0:10 | 14:40:00 |
|  9 | [[http://nbviewer.ipython.org/urls/raw.github.com/Unidata/unidata-python-workshop/master/Geocoded_METAR.ipynb][Point observations w/ TDS]]                     | ncss              | Sean      |   1:00 | 14:50:00 |
| 10 | [[http://nbviewer.ipython.org/urls/raw.github.com/Unidata/unidata-python-workshop/master/wms_sample.ipynb][Exploring WMS]] (w/ ncWMS & Cartpoy extensions) | wms_sample        | Sean      |   1:00 | 15:50:00 |
| 11 | End of day 2                                  |                   |           |        | 16:50:00 |
|----+-----------------------------------------------+-------------------+-----------+--------+----------|
#+TBLFM: @3$6..@-1$6=@-1$5+@-1$6;T::$1=@#-1

**** Workshop Schedule for <2015-07-22 Wed>

|----+----------------------------------------+-------------------+-----------+--------+----------|
|    | Section                                | IPyNB or Markdown | Presenter | Length |     Time |
|----+----------------------------------------+-------------------+-----------+--------+----------|
|  1 | Continental breakfast                  |                   |           |   0:30 | 08:30:00 |
|  2 | [[http://nbviewer.ipython.org/urls/raw.github.com/Unidata/unidata-python-workshop/master/CompositeRadar.ipynb][Accessing radar composites]]             | CompositeRadar    | Ryan      |   1:00 | 09:00:00 |
|  3 | Pythonic Section                       |                   |           |   1:00 | 10:00:00 |
|  4 | Break                                  |                   |           |   0:10 | 11:00:00 |
|  5 | Local TDS/CDM                          |                   |           |   1:00 | 11:10:00 |
|  6 | Lunch on your own                      |                   |           |   1:00 | 12:10:00 |
|  7 | New NCSS Python Client                 |                   |           |   1:00 | 13:10:00 |
|  8 | Met Py (including ported GEMPAK stuff) |                   |           |   1:00 | 14:10:00 |
|  9 | Netcdf case study                      |                   | Julien    |   1:00 | 15:10:00 |
| 10 | End of day 2                           |                   |           |        | 16:10:00 |
|----+----------------------------------------+-------------------+-----------+--------+----------|
#+TBLFM: @3$6..@-1$6=@-1$5+@-1$6;T::$1=@#-1


**** Please give us your feedback

From the Unidata [[http://www.unidata.ucar.edu/][page]], go to the "2014 Training Workshop" [[http://www.unidata.ucar.edu/events/2014TrainingWorkshop/][page]] by selecting
"Events" -> "2014 Training Workshop" from the menu. Click on the "Give us your
Feedback" link to get to the [[http://www.unidata.ucar.edu/community/surveys/2014training/survey.html][survey]].

Note: Please feel free to use the survey at any time during the class (and as
often as you like) as comments come to mind.
